Web/The_Complete_2024_Web_Development_Bootcamp/002.Introduction_to_HTML/002.000.Notes.org
#+title: Section 2: Introduction to HTML
#+author: Alfredo Mejia
#+options: num:nil html-postamble:nil
#+html_head: <link rel="stylesheet" type="text/css" href="https://cdn.jsdelivr.net/npm/bulma@1.0.4/css/bulma.min.css" /> <style>body {margin: 5%} h1,h2,h3,h4,h5,h6 {margin-top: 3%} .content ul:not(:first-child) {margin-top: 0.25em}}</style>

* Navigation
| Nav   | Title                                      | Links                                   |
|-------+--------------------------------------------+-----------------------------------------|
| Index | Notes Home                                 | \vert [[file:../../../index.html][html]] \vert [[file:../../../index.org][org]] \vert [[https://github.com/alfredo-mejia/notes/tree/main][github]] \vert |
| Home  | The Complete 2024 Web Development Bootcamp | \vert [[file:../000.Home.html][html]] \vert [[file:../000.Home.org][org]] \vert [[https://github.com/alfredo-mejia/notes/tree/main/Web/The_Complete_2024_Web_Development_Bootcamp][github]] \vert |
| Prev  | Section 1: Frontend Web Development        | \vert [[file:../001.Frontend_Web_Development/001.000.Notes.html][html]] \vert [[file:../001.Frontend_Web_Development/001.000.Notes.org][org]] \vert [[https://github.com/alfredo-mejia/notes/tree/main/Web/The_Complete_2024_Web_Development_Bootcamp/001.Frontend_Web_Development][github]] \vert |
| Next  | Section 3: Intermediate HTML               | \vert [[file:../003.Intermediate_HTML/003.000.Notes.html][html]] \vert [[file:../003.Intermediate_HTML/003.000.Notes.org][org]] \vert [[https://github.com/alfredo-mejia/notes/tree/main/Web/The_Complete_2024_Web_Development_Bootcamp/003.Intermediate_HTML][github]] \vert |

* Notes

** Section 2.1: What is HTML?
   - Every browser take different files and render them into a website
   - Websites cannot be made with just the CSS file or JS but you can make a website with just a HTML file
   - Remember HTML is just for structure and content
   - HTML stands for HyperText Markup Language
   - HyperText means it can have text with links (hyperlinks) so the browser (user) can be redirected
   - Markup Language means there are ways to "mark" text to have appear or behave some type of way; this is done with HTML tags

** Section 2.2: HTML Heading Elements
   #+BEGIN_SRC html
     <h1>Hello World</h1>
   #+END_SRC

   - Notice the opening and ending tag; the difference is the closing tag has a forward slash
   - The content of that HTML element is placed inside the tags
   - Tag vs Element? The tag are the actual ~<h1>~ and ~</h1>~ are the tags and the element is the entire thing including the tags and the content
   - The highest ("smallest") heading is ~<h6>~
   - Level 1 (~<h1>~) is the largest heading while level 6 (~<h6>~) is the smallest
   - Don't try to have multiple ~h1~ espeically back to back
   - Don't skip header levels so go in order (e.g. ~h1~ to ~h2~ etc.) not from ~h1~ to ~h3~
   - [[file:./002.002.HTML_Heading_Elements/index.html][Completed HTML Heading Elements Exercise]]
     
*** Section 2.2.1: Resources

**** Section 2.2.1.1: [[https://developer.mozilla.org/en-US/docs/Web/HTML/Element/Heading_Elements][The HTML Section Heading Elements by MDN Web Docs]]
     - ~h1~ to ~h6~ represent six levels of section headings with ~h1~ being the largest and ~h6~ being the smallest
     - By default, headings start on a new line and take up the full width available in their containing block and thus create a "box-level" box in the layout
     - The headings can be used as a table of contents, do not use them to resize text and don't skip heading levels
     - Avoid using multiple ~<h1>~ elements on one page (the top level should describe the content of the page similar to a title of a book)
       
** Section 2.3: HTML Paragraph Elements
   #+BEGIN_SRC html
     <p>This is a paragraph</p>
   #+END_SRC

   - Similar to the heading element; you have the opening and closing tag and then the content in between
   - Why do we need a paragraph element? The paragraph element would allow us to separate blocks of texts (paragraphs) to make content easier to read
   - [[file:./002.003.HTML_Paragraph_Elements/index.html][Completed HTML Paragraph Elements Exercise]]
     
** Section 2.4: Self Closing Tags
   - What is a void element? A void element is an element you are forebidden to put content inside the tag
   - So how do tags work with no content? These elements are called self-closing tags and it only has one tag (self-closing) instead of one opening and one closing
   
   #+BEGIN_SRC html
     <hr />
   #+END_SRC

   - Notice how it opens with an angle bracket and then uses a forward slash and then angle bracket similar (but in different way) to closing tags
   - ~<hr />~ is the horizontal rule which divides or adds a horizontal rule or "line"
   - Other void elements are the break element denoted as ~<br />~ and this element is used to separate content (text) into separate lines
   - Note when to use ~<br />~ and when to use ~<p>~; if you need to create another paragraph do not use ~<br />~ instead create a new paragraph element
   - Only use ~<br />~ when you need to separate lines but it is still the same paragraph like a poem or an address
   - Also the forward slash is not required; with the latest HTML it simply ignores the forward slash but it is good practice to add so it can be more understandable when viewing your code
   - [[file:./002.004.Self_Closing_Tags/index.html][Completed HTML Self Closing Tags Exercise]]
     
** Section 2.5: Movie Ranking Project
   - Create a webpage ranking your favorite movies with what you learned (headers, paragraph, and self closing tags) 
   - [[file:./002.005.Movie_Ranking_Project/index.html][Completed Move Ranking Project]]
     
** Section 2.6: How to Ace This Course (And Keep You Motivated)
   - In order to keep you motivatd, set yourself goals ask yourself the following question
   - Why do I want to learn this skill? I want to expand my skillset and create my own website agency company eventually
   - What will I achieve if I learn this skill? Possibly new career options and be able to full services on behalf of myself and not a company
   - How will this skill change my life and my career? Possibly get a higher position job and be able to work on my own company
   - How will learning this skill impact the lives of my family, friends, and coworkers? If I am able to target a higher position job or start a company then I'll be able to help the ones I love and help others start with own business
   - How will I feel if I never accomplish this? I'll feel like I failed. I'll feel like I have nothing to look forward to
   - What would my life look like if I manage to accomplish this? Hopefuly my life would look more fulfilled and more prosperous with possibly having a side business of my own
   - [[file:./002.006.How_to_Ace_This_Course_And_Keep_You_Motivated_Questions_Template.pdf][How to Ace This Course (And Keep You Motivated) Questions Template (PDF)]]
     
* Keywords
| Term                         | Definition                                                     |
|------------------------------+----------------------------------------------------------------|
| *HTML*                       | HyperText Markup Language                                      |
| *HTML Tag*                   | Actual "tag" that indicates which element it is                |
| *HTML Element*               | It is the HTML tags and the content it represents              |
| *HTML Header Element*        | Element that allows to provide and format titles and subtitles |
| *HTML Paragraph Element*     | Element to display blocks of text                              |
| *HTML Self Closing Elements* | HTML elements that do not require content or a closing tag     |
    
* Questions
  - *Q*: If headers behave as a box where it takes the whole width of the page, is it possible to change that behavior?
         - Possibly but we'll need CSS for that

* Summary
  - HTML stands for HyperText Markup Language which is a way to format text into titles, paragraphs, underline, bold, italicized, etc.
  - There are many HTML elements like headers, paragraph, self closing elements, and format and display content differently; these elements need an opening HTML tag and a closing HTML tag and the content goes in between while other are self-closing with no content
  - Not all HTML elements affect text, some add lines or images; also although there are not rules with some HTML there are standards such as only using one ~<h1>~ in a page and no skipping header levels
