archive/The_Complete_2024_Web_Development_Bootcamp/002.Introduction_to_HTML/002.000.Notes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-08-01 Thu 23:11 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Sec.2 Introduction to HTML</title>
<meta name="author" content="Alfredo Mejia" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../../scratch/bulma/bulma.css" /></head>
<body>
<div id="content" class="content">
<h1 class="title">Sec.2 Introduction to HTML</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org099e95a">Navigation</a></li>
<li><a href="#org89241cd">Notes</a>
<ul>
<li><a href="#orgdbad4a9">Section 2.1: What is HTML?</a></li>
<li><a href="#orgb2874d3">Section 2.2: HTML Heading Elements</a>
<ul>
<li><a href="#org60d4e49">Section 2.2.1: Resources</a></li>
</ul>
</li>
<li><a href="#org2e100b2">Section 2.3: HTML Paragraph Elements</a></li>
<li><a href="#org87e22b7">Section 2.4: Self Closing Tags</a></li>
<li><a href="#orgb0233e7">Section 2.5: Movie Ranking Project</a></li>
<li><a href="#orgfa4ca72">Section 2.6: How to Ace This Course (And Keep You Motivated)</a></li>
</ul>
</li>
<li><a href="#org82217da">Keywords</a></li>
<li><a href="#org4750b97">Questions</a></li>
<li><a href="#org92d00b1">Summary</a></li>
</ul>
</div>
</div>

<div id="outline-container-org099e95a" class="outline-2">
<h2 id="org099e95a">Navigation</h2>
<div class="outline-text-2" id="text-org099e95a">
<p>
<b>Home</b>: The Complete 2024 Web Development Bootcamp [<a href="../000.Home.html">html</a>] [<a href="../000.Home.html">org</a>] [<a href="https://github.com/alfredo-mejia/notes/tree/main/The%20Complete%202024%20Web%20Development%20Bootcamp">github</a>]
</p>

<p>
<b>Prev</b>: Sec.1 Front-End Web Development [<a href="../001.Front-End Web Development/001.000.Notes.html">html</a>] [<a href="../001.Front-End Web Development/001.000.Notes.html">org</a>] [<a href="https://github.com/alfredo-mejia/notes/tree/main/The%20Complete%202024%20Web%20Development%20Bootcamp/001.Front-End%20Web%20Development">github</a>]
</p>

<p>
<b>Next</b>: Sec.3 Intermediate HTML [<a href="../003.Intermediate HTML/003.000.Notes.html">html</a>] [<a href="../003.Intermediate HTML/003.000.Notes.html">org</a>] [<a href="https://github.com/alfredo-mejia/notes/tree/main/The%20Complete%202024%20Web%20Development%20Bootcamp/003.Intermediate%20HTML">github</a>]
</p>
</div>
</div>

<div id="outline-container-org89241cd" class="outline-2">
<h2 id="org89241cd">Notes</h2>
<div class="outline-text-2" id="text-org89241cd">
</div>
<div id="outline-container-orgdbad4a9" class="outline-3">
<h3 id="orgdbad4a9">Section 2.1: What is HTML?</h3>
<div class="outline-text-3" id="text-orgdbad4a9">
<ul class="org-ul">
<li>Every browser take different files and render them into a website</li>
<li>Websites cannot be made with just the CSS file or JS but you can make a website with just a HTML file</li>
<li>Remember HTML is just for structure and content</li>
<li>HTML stands for HyperText Markup Language</li>
<li>HyperText means it can have text with links (hyperlinks) so the browser (user) can be redirected</li>
<li>Markup Language means there are ways to "mark" text to have appear or behave some type of way; this is done with HTML tags</li>
</ul>
</div>
</div>

<div id="outline-container-orgb2874d3" class="outline-3">
<h3 id="orgb2874d3">Section 2.2: HTML Heading Elements</h3>
<div class="outline-text-3" id="text-orgb2874d3">
<div class="org-src-container">
<pre class="src src-html">&lt;h1&gt;Hello World&lt;/h1&gt;
</pre>
</div>

<ul class="org-ul">
<li>Notice the opening and ending tag; the difference is the closing tag has a forward slash</li>
<li>The content of that HTML element is placed inside the tags</li>
<li>Tag vs Element? The tag are the actual <code>&lt;h1&gt;</code> and <code>&lt;/h1&gt;</code> are the tags and the element is the entire thing including the tags and the content</li>
<li>The highest ("smallest") heading is <code>&lt;h6&gt;</code></li>
<li>Level 1 (<code>&lt;h1&gt;</code>) is the largest heading while level 6 (<code>&lt;h6&gt;</code>) is the smallest</li>
<li>Don't try to have multiple <code>h1</code> espeically back to back</li>
<li>Don't skip header levels so go in order (e.g. <code>h1</code> to <code>h2</code> etc.) not from <code>h1</code> to <code>h3</code></li>
<li><a href="002.002.HTML Heading Elements/index.html">Completed HTML Heading Elements Exercise</a></li>
</ul>
</div>

<div id="outline-container-org60d4e49" class="outline-4">
<h4 id="org60d4e49">Section 2.2.1: Resources</h4>
<div class="outline-text-4" id="text-org60d4e49">
</div>
<ul class="org-ul">
<li><a id="org63be650"></a>Section 2.2.1.1: <a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/Heading_Elements">The HTML Section Heading Elements by MDN Web Docs</a><br />
<div class="outline-text-5" id="text-org63be650">
<ul class="org-ul">
<li><code>h1</code> to <code>h6</code> represent six levels of section headings with <code>h1</code> being the largest and <code>h6</code> being the smallest</li>
<li>By default, headings start on a new line and take up the full width available in their containing block and thus create a "box-level" box in the layout</li>
<li>The headings can be used as a table of contents, do not use them to resize text and don't skip heading levels</li>
<li>Avoid using multiple <code>&lt;h1&gt;</code> elements on one page (the top level should describe the content of the page similar to a title of a book)</li>
</ul>
</div>
</li>
</ul>
</div>
</div>

<div id="outline-container-org2e100b2" class="outline-3">
<h3 id="org2e100b2">Section 2.3: HTML Paragraph Elements</h3>
<div class="outline-text-3" id="text-org2e100b2">
<div class="org-src-container">
<pre class="src src-html">&lt;p&gt;This is a paragraph&lt;/p&gt;
</pre>
</div>

<ul class="org-ul">
<li>Similar to the heading element; you have the opening and closing tag and then the content in between</li>
<li>Why do we need a paragraph element? The paragraph element would allow us to separate blocks of texts (paragraphs) to make content easier to read</li>
<li><a href="002.003.HTML Paragraph Elements/index.html">Completed HTML Paragraph Elements Exercise</a></li>
</ul>
</div>
</div>

<div id="outline-container-org87e22b7" class="outline-3">
<h3 id="org87e22b7">Section 2.4: Self Closing Tags</h3>
<div class="outline-text-3" id="text-org87e22b7">
<ul class="org-ul">
<li>What is a void element? A void element is an element you are forebidden to put content inside the tag</li>
<li>So how do tags work with no content? These elements are called self-closing tags and it only has one tag (self-closing) instead of one opening and one closing</li>
</ul>

<div class="org-src-container">
<pre class="src src-html">&lt;hr /&gt;
</pre>
</div>

<ul class="org-ul">
<li>Notice how it opens with an angle bracket and then uses a forward slash and then angle bracket similar (but in different way) to closing tags</li>
<li><code>&lt;hr /&gt;</code> is the horizontal rule which divides or adds a horizontal rule or "line"</li>
<li>Other void elements are the break element denoted as <code>&lt;br /&gt;</code> and this element is used to separate content (text) into separate lines</li>
<li>Note when to use <code>&lt;br /&gt;</code> and when to use <code>&lt;p&gt;</code>; if you need to create another paragraph do not use <code>&lt;br /&gt;</code> instead create a new paragraph element</li>
<li>Only use <code>&lt;br /&gt;</code> when you need to separate lines but it is still the same paragraph like a poem or an address</li>
<li>Also the forward slash is not required; with the latest HTML it simply ignores the forward slash but it is good practice to add so it can be more understandable when viewing your code</li>
<li><a href="./002.004.Self Closing Tags/index.html">Completed HTML Self Closing Tags Exercise</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgb0233e7" class="outline-3">
<h3 id="orgb0233e7">Section 2.5: Movie Ranking Project</h3>
<div class="outline-text-3" id="text-orgb0233e7">
<ul class="org-ul">
<li>Create a webpage ranking your favorite movies with what you learned (headers, paragraph, and self closing tags)</li>
<li><a href="002.005.Movie Ranking Project/index.html">Completed Move Ranking Project</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgfa4ca72" class="outline-3">
<h3 id="orgfa4ca72">Section 2.6: How to Ace This Course (And Keep You Motivated)</h3>
<div class="outline-text-3" id="text-orgfa4ca72">
<ul class="org-ul">
<li>In order to keep you motivatd, set yourself goals ask yourself the following question</li>
<li>Why do I want to learn this skill? I want to expand my skillset and create my own website agency company eventually</li>
<li>What will I achieve if I learn this skill? Possibly new career options and be able to full services on behalf of myself and not a company</li>
<li>How will this skill change my life and my career? Possibly get a higher position job and be able to work on my own company</li>
<li>How will learning this skill impact the lives of my family, friends, and coworkers? If I am able to target a higher position job or start a company then I'll be able to help the ones I love and help others start with own business</li>
<li>How will I feel if I never accomplish this? I'll feel like I failed. I'll feel like I have nothing to look forward to</li>
<li>What would my life look like if I manage to accomplish this? Hopefuly my life would look more fulfilled and more prosperous with possibly having a side business of my own</li>
<li><a href="002.006.How to Ace This Course (And Keep You Motivated) Questions Template.pdf">How to Ace This Course (And Keep You Motivated) Questions Template (PDF)</a></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org82217da" class="outline-2">
<h2 id="org82217da">Keywords</h2>
<div class="outline-text-2" id="text-org82217da">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Term</th>
<th scope="col" class="org-left">Definition</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><b>HTML</b></td>
<td class="org-left">HyperText Markup Language</td>
</tr>

<tr>
<td class="org-left"><b>HTML Tag</b></td>
<td class="org-left">Actual "tag" that indicates which element it is</td>
</tr>

<tr>
<td class="org-left"><b>HTML Element</b></td>
<td class="org-left">It is the HTML tags and the content it represents</td>
</tr>

<tr>
<td class="org-left"><b>HTML Header Element</b></td>
<td class="org-left">Element that allows to provide and format titles and subtitles</td>
</tr>

<tr>
<td class="org-left"><b>HTML Paragraph Element</b></td>
<td class="org-left">Element to display blocks of text</td>
</tr>

<tr>
<td class="org-left"><b>HTML Self Closing Elements</b></td>
<td class="org-left">HTML elements that do not require content or a closing tag</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org4750b97" class="outline-2">
<h2 id="org4750b97">Questions</h2>
<div class="outline-text-2" id="text-org4750b97">
<ul class="org-ul">
<li><b>Q</b>: If headers behave as a box where it takes the whole width of the page, is it possible to change that behavior?
<ul class="org-ul">
<li>Possibly but we'll need CSS for that</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org92d00b1" class="outline-2">
<h2 id="org92d00b1">Summary</h2>
<div class="outline-text-2" id="text-org92d00b1">
<ul class="org-ul">
<li>HTML stands for HyperText Markup Language which is a way to format text into titles, paragraphs, underline, bold, italicized, etc.</li>
<li>There are many HTML elements like headers, paragraph, self closing elements, and format and display content differently; these elements need an opening HTML tag and a closing HTML tag and the content goes in between while other are self-closing with no content</li>
<li>Not all HTML elements affect text, some add lines or images; also although there are not rules with some HTML there are standards such as only using one <code>&lt;h1&gt;</code> in a page and no skipping header levels</li>
</ul>
</div>
</div>
</div>
</body>
</html>
